# По введенным пользователем координатам двух точек
# вывести уравнение прямой вида y = kx + b, проходящей через эти точки.
print("Найдем уравнение прямой вида y = kx + b из точек из заданых.")
print("-" * 100)
x_a = int(input("Введите координату оси Х точки А: "))
y_a = int(input("Введите координату оси Y точки А: "))
x_b = int(input("Введите координату оси Х точки B: "))
y_b = int(input("Введите координату оси Y точки B: "))

# задаем формулы уравнений
k = (y_a - y_b) / (x_a - x_b)
b = y_b - k * x_b
# выводим результаты
print('Уравнение прямой на которой лежат заданные точки: ')
print(f'y = {k}x + {b}')
print(f'Для точки А: {y_a} = {k}*{x_a} + {b}')
print(f'Для точки B: {y_b} = {k}*{x_b} + {b}')
