# 4. Найти сумму n элементов следующего ряда чисел: 1, -0.5, 0.25, -0.125,…
# Количество элементов (n) вводится с  клавиатуры.
try:
    print('Сумма элементов ряда чисел 1, -0.5, 0.25, -0.125,…\n')
    num = abs(int(input('Введите длину ряда: '))) - 1

    start = 1
    result = 0

    for i in range(num):
        start = start / (-2)
        result += start

    print('Сумма последовательности: ', result + 1)
except ValueError:
    print('Введите число!')