# ПСформировать из введенного числа обратное по порядку входящих в него цифр и вывести на экран.
# Например, если введено число 3486, надо вывести 6843.пример, если введено число 34560, в нем 3 четные цифры (4, 6 и 0) и 2 нечетные (3 и 5).

try:
    print("Зеркалим число.\n")
    num = int(input('Введите целое число: '))
    num2 = 0
   # index = index * (-1)
    while num > 0:
        dig = num % 10
        num = num // 10
        num2 = num2 * 10
        num2 = num2 + dig


    print('Отзеркалено: ', num2)
except ValueError:
    print("Нужно ввести целое число, попробуйие вновь")
# if num % 2 == 0:
