# 5. Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

print('Опеделяем букву в алфавите по номеру позиции\n'
      'Только латинские строчные')
x = int(input('Введите позицию (1-25: '))
if x > 25 or x < 1:
    print('В алфавите нет столько букв. Попробуйте снова!')
    exit()

x_pos = chr(x + 96)

print(f'{x} буква в алфавите - {x_pos}')
