#	3. Написать программу, которая генерирует в указанных пользователем границах:
# a. случайное целое число,
# b. случайное вещественное число,
# c. случайный символ.
# Для каждого из трех случаев пользователь задает свои границы диапазона.
# Например, если надо получить случайный символ от 'a' до 'f', то вводятся эти символы.
# Программа должна вывести на экран любой символ алфавита от 'a' до 'f' включительно.

import random
import string

print('Генерация случайных значений - целых чисел, вещественных чисел, латинских символов.')
choice = input('Укажите какое число сгенерировать: \n'
               'integer - для целого числа \n'
               'any_int - для вещественного числа \n'
               'char - для латинского символа\n')

# проверка правильности ввденой команды
if choice != 'integer' and choice !='any_int' and choice != 'char':
    print('Неверная команда, зайдите заново')
    exit()

print("Задайте границы диапазона (числа для чисел, буквы для символов)")
h = input('Верхняя граница:')
l = input('Нижняя граница:')

# задать тип int для не символьных выборов
if choice != 'char':
    h = int(h)
    l = int(l)
if choice == 'char' and h not in string.ascii_lowercase or l not in string.ascii_lowercase:
    print('Только латинские строчные буквы . Начните заново.')
    exit()
# переопредлить границы числовых диапазонов если польователь неверно ввел
if h < l and choice != 'char':
    print("Вы перепутали границы, но ничего - алгоритм у нас умный :) ")
    sh = h
    sl = l
    l = sh
    h = sl
# переопредлить границы символьных диапазонов если пользователь неверно ввел
if choice == 'char' and ord(h) < ord(l):
    print("Вы перепутали границы, но ничего - алгоритм у нас умный :) ")
    sh = h
    sl = l
    l = sh
    h = sl

# сгенерировать значние в зависимости от команды
if choice == 'integer':
    result = random.randint(l, h)
    print(f'Ваше целое число: {result}')
elif choice == 'any_int':
    result = random.uniform(l, h)
    print(f'Ваше вещественное число: {result}')
elif choice == 'char':
    result = chr(random.randint(ord(l), ord(h)))
    print(f'Ваш латинский символ: {result}')
